glocklueng/032/LayerOne_2014/badge/code/stm32-prox/armsrc/fpgaloader.c
	// error indicator, tell user failed at ninit
	if (i==0){
  		OLEDPutstr("FPGA FAILED NINIT\n");
	  	OLEDDraw();
		i = 50;
		// get users attention
		while( i-- ) {
			InvertOLED( 1 );
			DelaymS( 100 );
			InvertOLED( 0 );
			DelaymS( 100 );
		}
		return;
	}

  	OLEDPutstr("FPGA BITSTREAM DOWNLOAD\n");
	OLEDDraw();

	if(bytereversal) {
		/* This is only supported for DWORD aligned images */
		if( ((int)FpgaImage % sizeof(DWORD)) == 0 ) {
			i=0;
			while(FpgaImageLen-->0)
				DownloadFPGA_byte(FpgaImage[(i++)^0x3]);
			/* Explanation of the magic in the above line: 
			 * i^0x3 inverts the lower two bits of the integer i, counting backwards
			 * for each 4 byte increment. The generated sequence of (i++)^3 is
			 * 3 2 1 0 7 6 5 4 11 10 9 8 15 14 13 12 etc. pp. 
			 */
		}
	} else {
	  while(FpgaImageLen-->0) {
		DownloadFPGA_byte(*FpgaImage++);
	  }
	}

	// continue to clock FPGA until ready signal goes high
	i=100000;
	while ( (i) && ( !(GETBIT( GPIO_FPGA_DONE ) ) ) ) {
		HIGH(GPIO_FPGA_CCLK);
		LOW(GPIO_FPGA_CCLK);
		i--;
	}
	// error indicator
	if ( i== 0 ) {

	  	OLEDPutstr("FPGA FAILED TO ACK DONE\nCHECK FPGA\n");
	  	OLEDDraw();
		
		i = 50;
		
		// get users attention
		while( i-- ) {
		  
			InvertOLED( 1 );
			DelaymS( 100 );
			InvertOLED( 0 );
			DelaymS( 100 );
		}
		
		return;
	}

 	OLEDPutstr("FPGA BITSTREAM LOADED\n");
  	OLEDDraw();
	
	FPGA_NCS_HIGH();
	FPGA_MOSI_HIGH();
	FPGA_SPCK_HIGH();
	
}

static char *bitparse_headers_start;
static char *bitparse_bitstream_end;
static int bitparse_initialized;
/* Simple Xilinx .bit parser. The file starts with the fixed opaque byte sequence
 * 00 09 0f f0 0f f0 0f f0 0f f0 00 00 01
 * After that the format is 1 byte section type (ASCII character), 2 byte length
 * (big endian), <length> bytes content. Except for section 'e' which has 4 bytes
 * length.
 */
static const char _bitparse_fixed_header[] = {0x00, 0x09, 0x0f, 0xf0, 0x0f, 0xf0, 0x0f, 0xf0, 0x0f, 0xf0, 0x00, 0x00, 0x01};
static int bitparse_init(void * start_address, void *end_address)
{
	bitparse_initialized = 0;
	
	if(memcmp(_bitparse_fixed_header, start_address, sizeof(_bitparse_fixed_header)) != 0) {
		return 0; /* Not matched */
	} else {
		bitparse_headers_start= ((char*)start_address) + sizeof(_bitparse_fixed_header);
		bitparse_bitstream_end= (char*)end_address;
		bitparse_initialized = 1;
		return 1;
	}
}

int bitparse_find_section(char section_name, char **section_start, unsigned int *section_length)
{
	char *pos = bitparse_headers_start;
	int result = 0;

	if(!bitparse_initialized) return 0;

	while(pos < bitparse_bitstream_end) {
		char current_name = *pos++;
		unsigned int current_length = 0;
		if(current_name < 'a' || current_name > 'e') {
			/* Strange section name, abort */
			break;
		}
		current_length = 0;
		switch(current_name) {
		case 'e':
			/* Four byte length field */
			current_length += (*pos++) << 24;
			current_length += (*pos++) << 16;
		default: /* Fall through, two byte length field */
			current_length += (*pos++) << 8;
			current_length += (*pos++) << 0;
		}
		
		if(current_name != 'e' && current_length > 255) {
			/* Maybe a parse error */
			break;
		}
		
		if(current_name == section_name) {
			/* Found it */
			*section_start = pos;
			*section_length = current_length;
			result = 1;
			break;
		}
		
		pos += current_length; /* Skip section */
	}
	
	return result;
}


//-----------------------------------------------------------------------------
// Find out which FPGA image format is stored in flash, then call DownloadFPGA
// with the right parameters to download the image
//-----------------------------------------------------------------------------
static const char _binary_fpga_bit_start[] = {
  #include "fpga.h"
  //#include "fpga_test.h"
};

static const char *_binary_fpga_bit_end=_binary_fpga_bit_start+sizeof(_binary_fpga_bit_start);

void FpgaDownloadAndGo(void)
{
	/* Check for the new flash image format: Should have the .bit file at &_binary_fpga_bit_start
	 */
	if(bitparse_init((void*)&_binary_fpga_bit_start, (void*)_binary_fpga_bit_end)) {
		/* Successfully initialized the .bit parser. Find the 'e' section and
		 * send its contents to the FPGA.
		 */
		char *bitstream_start;
		unsigned int bitstream_length;
		if(bitparse_find_section('e', &bitstream_start, &bitstream_length)) {
			DownloadFPGA(bitstream_start, bitstream_length, 0);
			
			return; /* All done */
		}
	}
	
	/* Fallback for the old flash image format: Check for the magic marker 0xFFFFFFFF
	 * 0xAA995566 at address 0x102000. This is raw bitstream with a size of 336,768 bits 
	 * = 10,524 DWORDs, stored as DWORDS e.g. little-endian in memory, but each DWORD
	 * is still to be transmitted in MSBit first order. Set the invert flag to indicate
	 * that the DownloadFPGA function should invert every 4 byte sequence when doing
	 * the bytewise download.
	 */
	if( *(uint32_t*)0x102000 == 0xFFFFFFFF && *(uint32_t*)0x102004 == 0xAA995566 )
		DownloadFPGA((char*)0x102000, 10524*4, 1);
}

//-----------------------------------------------------------------------------
// Set up the synchronous serial port, with the one set of options that we
// always use when we are talking to the FPGA. Both RX and TX are enabled.
//-----------------------------------------------------------------------------
void FpgaSetupSsc(unsigned char on_off)
{  
  
  NVIC_InitTypeDef   NVIC_InitStructure;
  
  /* Enable and set EXTIn Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQChannel;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 4;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 4;
  
  if( on_off == 1 ) 
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  else 
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
  
  NVIC_Init(&NVIC_InitStructure);

  return;
  
  NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQChannel;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
  
  if( on_off == 1 ) 
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
  else 
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
  NVIC_Init(&NVIC_InitStructure);
  
  
}


// DMA buffer

uint8_t fpga_dma_buffer[];

